Function Reference

# Classes
| | | |
|---|---|---|
| ActiveClass | ClassList | ClassNum |
| CLDropShadowEnabled | DelClass | EnableCLDropShadow |
| FillColorByClass | FPatByClass | GetClassArrow <sub>*obsolete in VectorWorks 2008*</sub>|
| GetClassBeginningMarker | GetClassEndMarker | GetClassOptions |
| GetCLDrpShadowData | GetClFillBack | GetClFillFore |
| GetClFPat | GetClLS <sub>*obsolete in Vectorworks 2013*</sub>| GetClLSN |
| GetClLW | GetClOpacity | GetClOpacityN |
| GetClPenBack | GetClPenFore | GetClTextStyleRef |
| GetClUseGraphic | GetClUseTextStyle | GetClVectorFill |
| GetCVis | GrayClass | HideClass |
| LSByClass | LWByClass | MarkerByClass |
| NameClass | OpacityByClass | OpacityByClassN |
| PenColorByClass | RenameClass | SetClassArrow <sub>*obsolete in VectorWorks 2008*</sub>|
| SetClassBeginningMarker | SetClassEndMarker | SetClassOptions |
| SetCLDrpShadowData | SetClFillBack | SetClFillFore |
| SetClFPat | SetClLS <sub>*obsolete in Vectorworks 2013*</sub>| SetClLSN |
| SetClLW | SetClOpacity | SetCLOpacityN |
| SetClPenBack | SetClPenFore | SetClTextStyleRef |
| SetClUseGraphic | SetClUseTextStyle | SetClUseTexture |
| SetClVectorFill | ShowClass